<?php
/*
 * Copyright (c) 2016 Christopher Abram.
 *
 * Definitions for field package.
 *
 * @package    core\classes\form\field
 * @author     Christopher Abram
 * @version    1.0
 * @date	08.09.2016
 */
 
// Standard character set:
/*define('REGEX_STANDARD', '[A-Za-zĄĆĘŁŃÓŚŹŻąćęłńóśźż\s]');
define('REGEX_STANDARD_PUNCTUATION', '[A-Za-zĄĆĘŁŃÓŚŹŻąćęłńóśźż\s\,\.\?\!]');
define('REGEX_NUMERIC', '[0-9]');
define('REGEX_ALPHANUMERIC', '[0-9A-Za-zĄĆĘŁŃÓŚŹŻąćęłńóśźż\s]');
define('REGEX_ALPHANUMERIC_PUNCTUATION', '[0-9A-Za-zĄĆĘŁŃÓŚŹŻąćęłńóśźż\s\,\.\?\!]');

// Special character set:
define('REGEX_EMAIL', '(?!(?:(?:\\x22?\\x5C[\\x00-\\x7E]\\x22?)|(?:\\x22?[^\\x5C\\x22]\\x22?)){255,})(?!(?:(?:\\x22?\\x5C[\\x00-\\x7E]\\x22?)|(?:\\x22?[^\\x5C\\x22]\\x22?)){65,}@)(?:(?:[\\x21\\x23-\\x27\\x2A\\x2B\\x2D\\x2F-\\x39\\x3D\\x3F\\x5E-\\x7E]+)|(?:\\x22(?:[\\x01-\\x08\\x0B\\x0C\\x0E-\\x1F\\x21\\x23-\\x5B\\x5D-\\x7F]|(?:\\x5C[\\x00-\\x7F]))*\\x22))(?:\\.(?:(?:[\\x21\\x23-\\x27\\x2A\\x2B\\x2D\\x2F-\\x39\\x3D\\x3F\\x5E-\\x7E]+)|(?:\\x22(?:[\\x01-\\x08\\x0B\\x0C\\x0E-\\x1F\\x21\\x23-\\x5B\\x5D-\\x7F]|(?:\\x5C[\\x00-\\x7F]))*\\x22)))*@(?:(?:(?!.*[^.]{64,})(?:(?:(?:xn--)?[a-z0-9]+(?:-+[a-z0-9]+)*\\.){1,126}){1,}(?:(?:[a-z][a-z0-9]*)|(?:(?:xn--)[a-z0-9]+))(?:-+[a-z0-9]+)*)|(?:\\[(?:(?:IPv6:(?:(?:[a-f0-9]{1,4}(?::[a-f0-9]{1,4}){7})|(?:(?!(?:.*[a-f0-9][:\\]]){7,})(?:[a-f0-9]{1,4}(?::[a-f0-9]{1,4}){0,5})?::(?:[a-f0-9]{1,4}(?::[a-f0-9]{1,4}){0,5})?)))|(?:(?:IPv6:(?:(?:[a-f0-9]{1,4}(?::[a-f0-9]{1,4}){5}:)|(?:(?!(?:.*[a-f0-9]:){5,})(?:[a-f0-9]{1,4}(?::[a-f0-9]{1,4}){0,3})?::(?:[a-f0-9]{1,4}(?::[a-f0-9]{1,4}){0,3}:)?)))?(?:(?:25[0-5])|(?:2[0-4][0-9])|(?:1[0-9]{2})|(?:[1-9]?[0-9]))(?:\\.(?:(?:25[0-5])|(?:2[0-4][0-9])|(?:1[0-9]{2})|(?:[1-9]?[0-9]))){3}))\\]))');
define('REGEX_PATH', '(https|http|ftp)\:\/\/|([a-z0-9A-Z]+\.[a-z0-9A-Z]+\.[a-zA-Z]{2,4})|([a-z0-9A-Z]+\.[a-zA-Z]{2,4})|\?([a-zA-Z0-9]+[\&\=\#a-z]+)');
define('REGEX_PHONE', '((?:(?:\(?(?:00|\+)([1-4]\d\d|[1-9]\d?)\)?)?[\-\.\s\/]?)?((?:\(?\d{1,}\)?[\-\.\s\/]?){0,})(?:[\-\.\s\/]?(?:#|ext\.?|extension|x)?[\-\.\s\/]?(\d+))?)');
define('REGEX_FLOAT', '[0-9A-Za-z\_\,\.\-\:\+\=]');
define('REGEX_INT', '-?([0-9])|([1-9][0-9]*)');
define('REGEX_INT_UNSIGNED', '([0-9])|([1-9][0-9]*)');
define('REGEX_TITLE', '[0-9A-Za-zĄĆĘŁŃÓŚŹŻąćęłńóśźż\s\_\,\.\-\<\>\(\)\[\]\!\?\@\#\$\%\^\&\*\:\;\/\{\}\+\=\~]');
define('REGEX_NAMEPATH', '([0-9]*[A-Za-z\_\,\.\-]+[0-9]*)');*/
		// \_\,\.\-\<\>\(\)\[\]\!\?\@\#\$\%\^\&\*\:\;\/\{\}\+\=\~